tests/performance/RegistersRESTCbroker.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de Pruebas" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="NumHilos" elementType="Argument">
            <stringProp name="Argument.name">NumHilos</stringProp>
            <stringProp name="Argument.value">${__P(numhilos,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="peticiones_por_segundo" elementType="Argument">
            <stringProp name="Argument.name">peticiones_por_segundo</stringProp>
            <stringProp name="Argument.value">${__P(peticiones_por_segundo,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="Host" elementType="Argument">
            <stringProp name="Argument.name">Host</stringProp>
            <stringProp name="Argument.value">${__P(host,iotagent)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NumHosts" elementType="Argument">
            <stringProp name="Argument.name">NumHosts</stringProp>
            <stringProp name="Argument.value">${__P(numhosts,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="Devices" elementType="Argument">
            <stringProp name="Argument.name">Devices</stringProp>
            <stringProp name="Argument.value">${__P(devices,10)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="Port" elementType="Argument">
            <stringProp name="Argument.name">Port</stringProp>
            <stringProp name="Argument.value">${__P(port,8081)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CommandURL" elementType="Argument">
            <stringProp name="Argument.name">CommandURL</stringProp>
            <stringProp name="Argument.value">${__P(cmdurl,http://10.95.96.139:8668)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="tiempo_arranque" elementType="Argument">
            <stringProp name="Argument.name">tiempo_arranque</stringProp>
            <stringProp name="Argument.value">${__P(tiempo_arranque,10)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="duracion_test" elementType="Argument">
            <stringProp name="Argument.name">duracion_test</stringProp>
            <stringProp name="Argument.value">${__P(duracion_test,100)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ServiceName" elementType="Argument">
            <stringProp name="Argument.name">ServiceName</stringProp>
            <stringProp name="Argument.value">${__P(service_name,myservice)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ServicePath" elementType="Argument">
            <stringProp name="Argument.name">ServicePath</stringProp>
            <stringProp name="Argument.value">${__P(service_path,/mysubservice)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="InitDevice" elementType="Argument">
            <stringProp name="Argument.name">InitDevice</stringProp>
            <stringProp name="Argument.value">${__P(init_device,101)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="EndDevice" elementType="Argument">
            <stringProp name="Argument.name">EndDevice</stringProp>
            <stringProp name="Argument.value">${__P(end_device,111)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo de Hilos" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${Devices}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${NumHilos}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${tiempo_arranque}</stringProp>
        <longProp name="ThreadGroup.start_time">1401890584000</longProp>
        <longProp name="ThreadGroup.end_time">1401890584000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="idNumber" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.end">${NumHosts}</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">idNumber</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Device" enabled="true">
          <stringProp name="CounterConfig.start">${InitDevice}</stringProp>
          <stringProp name="CounterConfig.end">${EndDevice}</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">device</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Gráfico de Resultados" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">GraphResults.xml</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="DistributionGraphVisualizer" testclass="ResultCollector" testname="Gráfico de Distribución (alfa)" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Muestreador BeanShell" enabled="true">
          <stringProp name="BeanShellSampler.query">int perfil = ${device} % 100 + 1; 
vars.put(&quot;perfil&quot;,String.valueOf(perfil));</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Registro REST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;devices&quot;:[&#xd;
 {&#xd;
   &quot;device_id&quot;: &quot;Device${ServiceName}${device}&quot;,&#xd;
   &quot;entity_type&quot;: &quot;mytype&quot;,&#xd;
   &quot;protocol&quot; : &quot;PDI-IoTA-UltraLight&quot;&#xd;
  }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__evalVar(Host)}</stringProp>
          <stringProp name="HTTPSampler.port">${Port}</stringProp>
          <stringProp name="HTTPSampler.path">/iot/devices</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Gestor de Cabecera HTTP" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Fiware-Service</stringProp>
                <stringProp name="Header.value">${ServiceName}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Fiware-ServicePath</stringProp>
                <stringProp name="Header.value">${ServicePath}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Aserción de Respuesta" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">201</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="-389526990">
              <stringProp name="49">1</stringProp>
              <stringProp name="1626324923">${peticiones_por_segundo}</stringProp>
              <stringProp name="1613330462">${tiempo_arranque}</stringProp>
            </collectionProp>
            <collectionProp name="-1651314548">
              <stringProp name="1626324923">${peticiones_por_segundo}</stringProp>
              <stringProp name="1626324923">${peticiones_por_segundo}</stringProp>
              <stringProp name="-1343341240">${duracion_test}</stringProp>
            </collectionProp>
            <collectionProp name="2011195840">
              <stringProp name="1626324923">${peticiones_por_segundo}</stringProp>
              <stringProp name="49">1</stringProp>
              <stringProp reference="../../collectionProp/stringProp[3]"/>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">aggregate-report.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Árbol de Resultados" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <Summariser guiclass="SummariserGui" testclass="Summariser" testname="Generar Resumen de Resultados" enabled="true"/>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>